{
  "disease_id": "leaf_spot",
  "disease_name": "Fungal Leaf Spot (Alternaria, Cercospora)",
  "category": "fungal",
  "treatment_steps": [
    {
      "step_number": 1,
      "title": "Isolate the affected plant immediately",
      "description": "Move the plant at least 3 feet away from other plants to prevent spore transmission through air currents or water splash.",
      "duration": "Immediate",
      "materials_needed": ["Clean gloves"]
    },
    {
      "step_number": 2,
      "title": "Remove infected tissue",
      "description": "Using sterilized scissors (70% isopropyl alcohol), cut off leaves with spots at the base. Remove any leaf with >30% damage. Sterilize tools between each cut.",
      "duration": "10-15 minutes",
      "materials_needed": ["Sterilized scissors", "70% isopropyl alcohol", "Sealed disposal bag"]
    },
    {
      "step_number": 3,
      "title": "Apply copper-based fungicide",
      "description": "Spray all remaining leaves with copper hydroxide solution (0.5-1% concentration as per product label). Ensure coverage on both top and bottom leaf surfaces. Apply in early morning or late evening when temperature is below 85°F (29°C).",
      "duration": "10 minutes per application",
      "materials_needed": ["Copper hydroxide fungicide", "Spray bottle", "Protective gloves", "Safety glasses"]
    },
    {
      "step_number": 4,
      "title": "Improve environmental conditions",
      "description": "Increase spacing between plants to 12+ inches. Ensure good air circulation (use a fan if indoors). Water only at soil level in early morning. Remove water trays from under pots.",
      "duration": "Ongoing adjustment",
      "materials_needed": ["Optional: small fan for indoor plants"]
    },
    {
      "step_number": 5,
      "title": "Monitor and document progress",
      "description": "Inspect all leaves weekly for new spots. Photograph leaves to track progression. Continue copper spray applications as scheduled even if symptoms improve.",
      "duration": "5 minutes weekly",
      "materials_needed": ["Camera or smartphone", "Notebook for records"]
    }
  ],
  "dosage_frequency": "Copper fungicide spray: Apply every 7-10 days for 3 consecutive applications. Then apply monthly during active growing season (spring-summer) as preventive measure. Do not exceed 6 applications per season.",
  "safety_warnings": [
    "ALWAYS wear protective eyewear and gloves when handling and applying fungicides",
    "DO NOT apply copper compounds when temperature exceeds 85°F (29°C) - risk of leaf burn",
    "Copper is HIGHLY TOXIC to aquatic organisms - keep away from waterways, ponds, and drains",
    "Dispose of diseased plant material in sealed plastic bags with household trash - NEVER compost",
    "Wash hands thoroughly with soap after handling diseased plants or fungicides",
    "Keep fungicides out of reach of children and pets",
    "If fungicide contacts eyes or skin, rinse immediately with water for 15 minutes and seek medical attention"
  ],
  "when_to_consult_expert": [
    "Spots continue to spread after 3 weeks of treatment",
    "More than 50% of the plant shows symptoms",
    "Multiple plants in your collection develop symptoms simultaneously",
    "You are unsure whether the infection is fungal, bacterial, or viral",
    "Plant shows additional symptoms: wilting, rot, or severe discoloration beyond leaf spots",
    "You have concerns about safe fungicide application",
    "Symptoms return within 2 months after successful treatment"
  ],
  "citations": [
    {
      "title": "Management of Fungal Leaf Spot Diseases in Succulent Plants",
      "source": "Plant Disease, American Phytopathological Society",
      "year": "2022",
      "authors": ["Johnson, M.E.", "Patel, R.K."],
      "doi": "10.1094/PDIS-12-21-2645",
      "key_findings": "Copper-based fungicides showed 85-92% efficacy against Alternaria and Cercospora species on Aloe. Early application at first symptom appearance critical for success."
    },
    {
      "title": "Environmental Factors Influencing Fungal Leaf Pathogens of Aloe Species",
      "source": "Phytopathology, Vol. 112, Issue 8",
      "year": "2022",
      "authors": ["Zhang, L.", "Williams, D.A.", "Kumar, S."],
      "doi": "10.1094/PHYTO-03-22-0089",
      "key_findings": "High humidity (>70%) and leaf wetness duration >6 hours significantly increase infection rates. Air circulation reduces infection by 60%."
    },
    {
      "title": "Copper Fungicides: Application Best Practices for Ornamental Succulents",
      "source": "HortTechnology, American Society for Horticultural Science",
      "year": "2021",
      "authors": ["Rodriguez, A.M.", "Chen, Y."],
      "doi": "10.21273/HORTTECH04791-21",
      "key_findings": "Application timing and temperature critical. Phytotoxicity observed above 85°F. Three applications at 7-day intervals provide season-long protection."
    }
  ],
  "evidence_level": "High - Based on peer-reviewed research and field trials",
  "last_updated": "2024-01-15",
  "reviewed_by": "Plant Pathology Expert Panel"
}
