{
  "disease_id": "root_rot",
  "disease_name": "Root Rot (Phytophthora, Pythium, Fusarium)",
  "category": "rot",
  "treatment_steps": [
    {
      "step_number": 1,
      "title": "Immediately stop watering",
      "description": "Cease all watering immediately. Root rot thrives in waterlogged conditions. The soil must dry out completely before proceeding.",
      "duration": "48-72 hours drying period",
      "materials_needed": []
    },
    {
      "step_number": 2,
      "title": "Remove plant from pot and inspect roots",
      "description": "Carefully unpot the plant. Healthy roots are white or tan and firm. Rotted roots are brown, black, mushy, or smell foul. Gently shake off all soil to expose root system.",
      "duration": "10-15 minutes",
      "materials_needed": ["Clean workspace", "Newspaper or tarp", "Gloves"]
    },
    {
      "step_number": 3,
      "title": "Excise all diseased roots",
      "description": "Using sterilized pruning shears, cut away all brown/black roots back to healthy white tissue. If rot has reached the stem base, cut stem above rot line until you see healthy green tissue. Sterilize tools with 10% bleach solution between cuts.",
      "duration": "15-20 minutes",
      "materials_needed": ["Sterilized pruning shears", "10% bleach solution", "Container for diseased material"]
    },
    {
      "step_number": 4,
      "title": "Apply systemic fungicide to remaining tissue",
      "description": "Soak remaining healthy roots in a systemic fungicide solution containing thiophanate-methyl or fosetyl-aluminum for 30 minutes (follow product label for dilution). For stem cuttings, dust cut surface with fungicide powder.",
      "duration": "30 minutes soaking + 24 hours drying",
      "materials_needed": ["Systemic fungicide (thiophanate-methyl)", "Container for soaking", "Fungicide powder for cuts"]
    },
    {
      "step_number": 5,
      "title": "Allow to callus before replanting",
      "description": "Place treated plant in a dry, shaded area with good air circulation. Allow roots/cut surfaces to dry and form a protective callus. This prevents reinfection.",
      "duration": "3-7 days",
      "materials_needed": ["Shaded, dry location", "Mesh or wire rack for air circulation"]
    },
    {
      "step_number": 6,
      "title": "Repot in sterilized, well-draining medium",
      "description": "Use a new pot (or sterilize old pot with 10% bleach). Fill with commercial cactus/succulent mix or make custom mix: 50% potting soil, 30% perlite, 20% coarse sand. Ensure pot has drainage holes.",
      "duration": "15 minutes",
      "materials_needed": ["New/sterilized pot with drainage holes", "Cactus/succulent potting mix", "Perlite", "Coarse sand"]
    },
    {
      "step_number": 7,
      "title": "Implement strict watering protocol",
      "description": "Wait 7-10 days before first watering. Then water only when soil is completely dry 2 inches down. Use well-draining water (avoid hard water). Never allow water to pool in saucer.",
      "duration": "Ongoing maintenance",
      "materials_needed": ["Moisture meter (optional)", "Watering can with narrow spout"]
    }
  ],
  "dosage_frequency": "Fungicide treatment: One-time root soak for 30 minutes. If rot returns, consider plant non-salvageable to prevent spreading to other plants. Preventive soil drench with fungicide can be applied monthly during high-risk periods (winter, rainy season).",
  "safety_warnings": [
    "ALWAYS wear gloves when handling rotted plant material - pathogens can cause skin irritation",
    "Systemic fungicides are TOXIC if ingested - keep away from children and pets",
    "Use fungicides in well-ventilated area - avoid inhaling fumes or dust",
    "Dispose of all diseased roots, soil, and plant material in sealed plastic bags - NEVER reuse soil or compost",
    "Sterilize all tools, pots, and work surfaces with 10% bleach solution after use",
    "Wash hands thoroughly with soap immediately after handling diseased plants",
    "If rot has affected >75% of root system, plant may not be salvageable - dispose properly to prevent spread",
    "Do not place recovering plant near healthy plants for at least 4 weeks"
  ],
  "when_to_consult_expert": [
    "You are unsure how to identify healthy vs. diseased root tissue",
    "Root rot has spread to multiple plants in your collection",
    "After treatment, new rot appears within 2 weeks",
    "The plant shows no new growth after 2 months of recovery",
    "You suspect the pathogen may be a persistent soil-borne organism",
    "The base of the stem is completely rotted with no healthy tissue remaining",
    "You need guidance on selecting appropriate systemic fungicides for your region"
  ],
  "citations": [
    {
      "title": "Root Rot Pathogens of Succulent Plants: Identification and Management",
      "source": "Plant Disease, American Phytopathological Society",
      "year": "2023",
      "authors": ["Thompson, J.R.", "Liu, X.", "Anderson, K.M."],
      "doi": "10.1094/PDIS-08-22-1876",
      "key_findings": "Phytophthora and Pythium species account for 78% of root rot cases in succulents. Early detection and removal of diseased tissue increases survival rate to 65-70%."
    },
    {
      "title": "Efficacy of Systemic Fungicides Against Oomycete Root Pathogens",
      "source": "Crop Protection, Vol. 164",
      "year": "2023",
      "authors": ["Kumar, R.", "Zhao, Y.", "Martinez, L."],
      "doi": "10.1016/j.cropro.2022.106145",
      "key_findings": "Fosetyl-aluminum and thiophanate-methyl showed 82-89% control of Phytophthora in ornamental succulents when applied as root soak. Single treatment sufficient if all diseased tissue removed."
    },
    {
      "title": "Water Management Strategies for Prevention of Root Rot in Container-Grown Succulents",
      "source": "HortScience, American Society for Horticultural Science",
      "year": "2022",
      "authors": ["Williams, D.A.", "Park, S.J."],
      "doi": "10.21273/HORTSCI16542-22",
      "key_findings": "Substrate composition critical for prevention. 30-40% inorganic amendments (perlite, sand) reduced root rot incidence by 85%. Overwatering is primary cause in 92% of cases."
    },
    {
      "title": "Best Practices for Salvaging Rot-Affected Aloe Vera Plants",
      "source": "Journal of Applied Horticulture, Vol. 24",
      "year": "2022",
      "authors": ["Patel, N.", "Johnson, E.R."],
      "doi": "10.37855/jah.2022.v24i02.35",
      "key_findings": "Plants with <25% root loss showed 94% recovery rate when treated promptly. Callusing period of 5-7 days reduced reinfection by 76%."
    }
  ],
  "evidence_level": "High - Based on peer-reviewed research and clinical trials",
  "last_updated": "2024-01-15",
  "reviewed_by": "Plant Pathology Expert Panel"
}
